package com.rh.note.action;

/**
 * 浏览文件列表
 */
public class BrowseFileListAction {

    /**
     * 定位文件位置
     */

    /**
     * 移动文件<br>
     * 鼠标拖动<br>
     * 右键菜单选择目录
     */

    /**
     * 展开全部
     */

    /**
     * 收起全部
     */

    /**
     * 展开选中的目录<br>
     * 快捷键 ctrl + <br>
     * 点击展开标识
     */

    /**
     * 收起选中的目录<br>
     * 快捷键 ctrl - <br>
     * 点击收起标识
     */

    /**
     * 打开文件<br>
     * 快捷键 回车<br>
     * 双击
     */

    /**
     * 删除文件<br>
     * 快捷键 del <br>
     * 右键菜单删除
     */

    /**
     * 创建文件
     */

    /**
     * 复制文件<br>
     * 快捷键 ctrl c <br>
     * 右键菜单复制
     */

    /**
     * 粘贴文件<br>
     * 快捷键 ctrl v <br>
     * 右键菜单粘贴
     */

}
