package com.rh.note.action;

/**
 * 编辑操作
 */
public class EditAction {

    /**
     * 鼠标按住选择
     */

    /**
     * 选择文本块 <br>
     * ctrl w
     */

    /**
     * 创建多个光标
     * alt shift 鼠标点击或按住选择
     */

    /**
     * 向上创建一行
     */

    /**
     * 向下创建一行
     */

    /**
     * 删除一行
     */

    /**
     * 复制一行
     * ctrl d
     * 如果有选中文本, 则复制选中的文本
     */

    /**
     * 复制
     */

    /**
     * 粘贴
     */

    /**
     * 编辑文本
     */

    /**
     * 保存 <br>
     * ctrl s
     */

    /**
     * 折叠块 <br>
     * 点击折叠 <br>
     * ctrl -
     */

    /**
     * 展开块 <br>
     * 点击展开 <br>
     * ctrl +
     */

}
